<?php
namespace common\models;

use Yii;

class Lottery_order extends Base_model
{
	public static $proInfo = array(
		'NO0001'=>'蛋糕卡通毛巾',
		'NO0002'=>'萌萌哒的鸡',
		'NO0003'=>'金鸡吊坠',
		'NO0004'=>'户外便携包',
		'NO0005'=>'健康瑜伽垫',
		'NO0006'=>'萌猫暖宝',
		'NO0007'=>'反向晴雨伞',
		'NO0008'=>'3D益智拼图',
		'NO0009'=>'司庆纪念币',
		'NO0010'=>'便携式餐具',
		'NO00011'=>'便携式餐具',
		'NO00012201707'=>'运动臂包（黑色）',
		'NO000132017'=>'运动臂包（粉色）',
		'NO000152017'=>'金钥匙吊坠',
		'NO000162017'=>'钱币册简装',
		'NO000172017'=>'随身口袋三折伞',
		'NO000182017'=>'棉质毛巾礼盒',
		'NO000192017'=>'血压仪',
		'NO000202017'=>'一支玫瑰',
		'NO000232017'=>'如意U盘',
		'NO00024'=>'金秋团圆（中秋金箔月饼饰品）',
		'NO000252017'=>'月饼礼盒（吃的月饼）'
	);
	public static function tableName()
	{
		return '{{%lottery_order}}';
	}
}
