<?php
namespace common\models;

use Yii;

class Return_cause extends Base_model
{
	public static function tableName()
	{
		return '{{%return_cause}}';
	}

	static $catArr=array(
			'1' => array(
					'1' => '未按约定时间发货',
					'2' => '退运费',
					'3' => '等不及了'
			),
			'2' => array(
					'1' => '收到商品破损',
					'2' => '商品错发/漏发',
					'3' => '商品需要维修',
					'4' => '发票问题',
					'5' => '收到商品与描述不符',
					'6' => '商品质量问题',
			),
			'3' => array(
					'1' => '我不想买了',
					'2' => '信息填写错误，重新拍',
					'3' => '卖家缺货',
					'4' => '付款遇到问题（如余额不足、不知道怎么付款等）',
					'5' => '拍错了',
					'6' => '其他原因'
			)
				
	);
	
	static $cat=array(
			'1' => '退款原因',
			'2' => '退货原因',
			'3' => '取消订单原因'
		
	);
	
	static $bank=array(
			'1' => '中国工商银行',
			'2' => '中国建设银行',
			'3' => '中国银行',
			'4' => '中国农业银行',
			'5' => '招商银行',
			'6' => '邮政储蓄银行',
			'7' => '民生银行',
			'8' => '长沙银行',
			'9' => '北京银行',
			'10' => '浦发银行',
			'11' => '华夏银行',
			'12' => '广发银行',
			'13' => '支付宝',
	
	);
	
}
